{
  "locale": "pl",
  "translations": {
    "heroCardSubtitle": "Student i freelancer • Praca zdalna • Dostępny do współpracy z klientami",
    "heroCardTitle": "O mnie",
    "whoIAmTitle": "Kim jestem",
    "whoIAmText": " Jestem Mateusz — student i aktywny freelancer, który lubi zamieniać chaotyczne, złożone problemy w proste i łatwe w utrzymaniu rozwiązania. Uwielbiam pracować bezpośrednio z klientami i dążę do pełnoetatowego freelancingu. Moja praca skupia się na przejrzystości, niezawodności i pragmatycznym dostarczaniu rozwiązań. ",
    "howIChooseToolsTitle": "Jak wybieram narzędzia",
    "howIChooseToolsText1": " Nie gonię za modnymi hasłami — wybieram odpowiednie narzędzie do problemu. Oznacza to wybór rozwiązań pasujących do zakresu, harmonogramu i przyszłej łatwości utrzymania projektu, a nie podążanie za trendami. Moim priorytetem są praktyczne, solidne efekty, które ułatwiają życie klientowi. ",
    "howIChooseToolsText2": " W praktyce oznacza to pragmatyczne decyzje architektoniczne, rozsądne kompromisy między szybkością a skalowalnością oraz koncentrację na kodzie łatwym do rozwijania. Dostosowuję podejście do potrzeb mobilnych, webowych lub backendowych w zależności od wymagań projektu. ",
    "howIChooseToolsText3": " Do tego portfolio użyłem Angulara, ponieważ przesunąłem część uwagi w stronę tworzenia aplikacji webowych po wcześniejszej pracy nad projektami mobilnymi i backendowymi. ",
    "howIChooseToolsText4": " Zrealizowałem także kilka projektów w WordPressie i mogę pracować w różnych technologiach, aby dostarczyć właściwy rezultat. ",
    "myApproachTitle": "Moje podejście",
    "myApproachText": "Prosta zasada: {$START_EMPHASISED_TEXT}upraszczam złożone rzeczy{$CLOSE_EMPHASISED_TEXT}. Rozbijam problemy na części, usuwam to, co zbędne, i dostarczam pragmatyczne rozwiązania łatwe w utrzymaniu. Cenię sobie jasną komunikację z klientami, iteracyjne dostarczanie i praktyczne decyzje projektowe, które pozwalają utrzymać projekty w harmonogramie i budżecie. ",
    "whatICanHelpWithTitle": "W czym mogę Ci pomóc",
    "helpItem1": "Freelance’owy rozwój aplikacji mobilnych i funkcji skierowanych do klienta",
    "helpItem2": "Skrypty backendowe, automatyzacja i integracje",
    "helpItem3": "Aplikacje webowe i MVP",
    "helpItem4": "Projekty małej i średniej skali, gdzie liczy się przejrzystość i szybkość",
    "siteImagesTitle": "Obrazy na stronie i AI",
    "siteImagesText": " Wszystkie ilustracje i grafiki na stronie zostały wygenerowane przy użyciu ComfyUI i różnych modeli generatywnych — to mały eksperyment z zastosowaniem AI w wizualach przy zachowaniu ludzkiego podejścia do produktu. ",
    "portfolioAsResumeTitle": "Portfolio jako CV",
    "portfolioAsResumeText": " To portfolio pełni również rolę mojego CV — zobacz sekcję Projekty, aby znaleźć konkretne przykłady i linki. Szczegóły projektów trzymam osobno, abyś mógł samodzielnie eksplorować próbki pracy i rezultaty. ",
    "languagesHobbiesTitle": "Języki i hobby",
    "languagesText": "{$START_TAG_STRONG}Języki:{$CLOSE_TAG_STRONG} angielski, polski.",
    "hobbiesText": "{$START_TAG_STRONG}Poza kodowaniem:{$CLOSE_TAG_STRONG} siłownia / podnoszenie ciężarów i wędkarstwo — cenię koncentrację, cierpliwość i konsekwencję zarówno w treningu, jak i w programowaniu.",
    "workWithMeTitle": "Współpraca ze mną",
    "workWithMeText": " Jeśli jesteś potencjalnym klientem i chcesz kogoś, kto uprości złożone rzeczy i zbuduje działające rozwiązanie, {$START_LINK}skontaktuj się ze mną{$CLOSE_LINK}. Odpowiadam szybko i lubię rozmawiać o praktycznych rozwiązaniach. Pracuję zdalnie i jestem gotów na projekty freelancerskie każdej wielkości. ",
    "aboutSectionTitle": " O mnie ",
    "aboutSectionText": " Jestem studentem i freelancerem, który lubi współpracować z klientami, aby ożywiać ich pomysły. Skupiam się na tworzeniu prostych, skutecznych rozwiązań dla złożonych problemów — zawsze używając właściwego narzędzia do zadania. Buduję aplikacje, strony internetowe i automatyzacje, a także pasjonuję się sztuczną inteligencją — od tradycyjnego uczenia maszynowego po generatywne AI. Zorientowany na klienta i gotów pomóc Ci przekształcić koncepcje w działające produkty. ",
    "titleWorkSection": "Zobacz część mojej pracy",
    "projectsTab": "Projekty",
    "realizationsTab": "Realizacje",
    "jobsTab": "Prace",
    "titleEducatinSection": "Ścieżka edukacyjna",
    "educationTab": "Edukacja",
    "certificationsTab": "Certyfikaty",
    "homeTitle": "👋 Cześć, jestem Mateusz — Developer aplikacji mobilnych i webowych",
    "homeSubtitle": "Tworzę proste i skuteczne doświadczenia cyfrowe.",
    "projectRepoButton": "Repozytorium projektu",
    "projectTitleListPage": "Projekty",
    "contactLabelName": "Wpisz swoje imię",
    "contactPlaceholderName": "Andrzej",
    "contactEmailLabel": "Wpisz swój email",
    "contactEmailPlaceholder": "twojmail@example.com",
    "contactSubjectLabel": "Wpisz temat",
    "contactSubjectPlaceholder": "Temat",
    "contactMessageLabel": "Wpisz swoją wiadomość",
    "contactMessagePlaceholder": "Twoja wiadomość...",
    "submitContactButton": " Wyślij ",
    "submitCrashMessage": "Kliknij, aby skontaktować się ze mną przez email",
    "submitSuccessful": "Email wysłany pomyślnie",
    "requiredFieldError": "Pole jest wymagane",
    "emailFieldError": "Podaj prawidłowy adres email",
    "lengthFieldError": " Pole nie może być dłuższe niż {$PH} znaków",
    "subtitleContactSection": "Skontaktuj się ze mną w sprawie pytań lub współpracy",
    "titleContactSection": "Skontaktuj się ze mną!",
    "privacyPolicyLink": " Polityka prywatności ",
    "screenshotsTitle": "Zrzuty ekranu",
    "technologiesUsed": " Użyte technologie: ",
    "links": " Linki: ",
    "skills": " Umiejętności: "
  }
}
