{
  "locale": "pl",
  "translations": {
    "homeNav": "Start",
    "aboutNav": "O mnie",
    "contactNav": "Kontakt",
    "heroCardSubtitle": "Student i freelancer • Praca zdalna • Otwarty na nowe projekty",
    "heroCardTitle": "O mnie",
    "whoIAmTitle": "Kim jestem?",
    "whoIAmText": "Jestem Mateusz — student i aktywny freelancer, który uwielbia przekształcać skomplikowane problemy w proste, łatwe w utrzymaniu rozwiązania. Lubię bezpośrednią współpracę z klientami i planuję rozwinąć się w pełnoetatowego freelancera. W mojej pracy stawiam na przejrzystość, niezawodność i pragmatyczne podejście.",
    "myApproachTitle": "Moje podejście",
    "myApproachText": "Prosta zasada: {$START_EMPHASISED_TEXT}upraszczam skomplikowane rzeczy{$CLOSE_EMPHASISED_TEXT}. Rozkładam problemy na czynniki pierwsze, usuwam zbędne elementy i dostarczam pragmatyczne rozwiązania, które są łatwe w utrzymaniu. Cenię jasną komunikację z klientami, iteracyjne podejście do realizacji oraz praktyczne decyzje projektowe, które pozwalają dotrzymywać terminów i budżetu.",
    "siteImagesTitle": "Grafiki na stronie i AI",
    "siteImagesText": "Wszystkie ilustracje i grafiki na stronie zostały wygenerowane przy użyciu ComfyUI oraz różnych modeli generatywnych — mały eksperyment z wykorzystaniem AI do tworzenia wizualizacji, przy jednoczesnym zachowaniu ludzkiego podejścia do produktu.",
    "whatICanHelpWithTitle": "W czym mogę Ci pomóc",
    "helpItem1": "Freelancerski rozwój aplikacji mobilnych i funkcji dla użytkowników",
    "helpItem2": "Skrypty backendowe, automatyzacja i integracje",
    "helpItem3": "Aplikacje webowe i MVP",
    "helpItem4": "Małe i średnie projekty, gdzie liczy się przejrzystość i szybkość",
    "aboutSectionTitle": "O mnie",
    "aboutSectionText": "Jestem studentem i freelance developerem, który uwielbia współpracować z klientami, by wcielać ich pomysły w życie. Skupiam się na tworzeniu prostych, skutecznych rozwiązań dla złożonych problemów — zawsze używam odpowiednich narzędzi do danego zadania. Tworzę aplikacje, strony internetowe i automatyzacje, a także pasjuję się sztuczną inteligencją — od tradycyjnego uczenia maszynowego po generatywne AI. Nastawiony na klienta i gotowy pomóc Ci przekształcić koncepcje w działające produkty.",
    "aboutMeButton": "Dowiedz się więcej o mnie",
    "educationPresent": "Obecnie",
    "educationGradeField": "Ocena: {$INTERPOLATION}",
    "titleWorkSection": "Moje realizacje",
    "projectsTab": "Projekty",
    "realizationsTab": "Realizacje",
    "jobsTab": "Kariera",
    "titleEducationSection": "Moja droga edukacyjna",
    "educationTab": "Edukacja",
    "homeTitleMeta": "Mateusz | Freelance Developer & AI Enthusiast",
    "homeDescriptionMeta": "Student i freelancer tworzący proste i skuteczne rozwiązania cyfrowe. Strony, aplikacje i automatyzacje dopasowane do Twoich potrzeb.",
    "certificationsTab": "Certyfikaty",
    "homeTitle": "👋 Cześć, jestem Mateusz.",
    "homeSubtitle": "Tworzę proste, skuteczne rozwiązania cyfrowe.",
    "jobPresent": "Obecnie",
    "projectRepoButton": "Repozytorium projektu",
    "projectTitleListPage": "Projekty",
    "contactLabelName": "Wpisz swoje imię",
    "contactPlaceholderName": "Jan",
    "contactEmailLabel": "Wpisz swój email",
    "contactEmailPlaceholder": "twojmail@example.com",
    "contactSubjectLabel": "Wpisz temat",
    "contactSubjectPlaceholder": "Temat",
    "contactMessageLabel": "Wpisz wiadomość",
    "contactMessagePlaceholder": "Twoja wiadomość...",
    "submitContactButton": "Wyślij",
    "submitCrashMessage": "Kliknij, aby skontaktować się ze mną przez email",
    "submitSuccessful": "Email został wysłany pomyślnie",
    "requiredFieldError": "To pole jest wymagane",
    "emailFieldError": "Wpisz poprawny adres email",
    "lengthFieldError": "Pole nie może być dłuższe niż {$PH} znaków",
    "contactHeroCardSubtitle": "Śmiało skontaktuj się ze mną w sprawie zapytań lub współpracy.",
    "contactHeroCardTitle": "Kontakt",
    "subtitleContactSection": "Śmiało skontaktuj się ze mną w sprawie zapytań lub współpracy",
    "titleContactSection": "Skontaktuj się ze mną!",
    "emailSent": "Email został wysłany!",
    "emailSentText": "Dziękuję za Twoją wiadomość. Wkrótce się odezwę.",
    "networkError": "Błąd sieci",
    "networkErrorText": "Nie można pobrać danych.",
    "privacyPolicyLink": "Polityka prywatności",
    "contactLink": "Skontaktuj się",
    "privacyPolicyHeroCardSubtitle": "Data obowiązywania: 28.09.2025",
    "privacyPolicyHeroCardTitle": "Polityka Prywatności",
    "privacyPolicySection1Title": "1. Jakie informacje zbieram",
    "privacyPolicySection1Text": "Kiedy korzystasz z formularza kontaktowego na tej Stronie, mogę zbierać następujące dane osobowe:",
    "privacyPolicySection1Item1": "Imię i nazwisko",
    "privacyPolicySection1Item2": "Adres email",
    "privacyPolicySection1Item3": "Treść wiadomości (wysyłany przez Ciebie tekst)",
    "privacyPolicySection2Title": "2. Jak zbieram informacje",
    "privacyPolicySection2Text": "Zbieram informacje, które dobrowolnie podajesz, wypełniając i wysyłając formularz kontaktowy na Stronie. Nie wymagam tworzenia konta, aby się ze mną skontaktować.",
    "privacyPolicySection3Title": "3. Cel i podstawa prawna przetwarzania",
    "privacyPolicySection3Text": "Wykorzystuję podane przez Ciebie informacje wyłącznie w celu odpowiedzi na Twoje zapytanie i związanej z tym korespondencji. Podstawą prawną przetwarzania tych danych jest uzasadniony interes w odpowiadaniu na wiadomości wysyłane przez formularz kontaktowy oraz/lub wykonanie umowy, gdy ma to zastosowanie.",
    "privacyPolicySection4Title": "4. Przechowywanie i retencja danych",
    "privacyPolicySection4Text": "Wiadomości są zazwyczaj dostarczane i przechowywane w mojej skrzynce email. Będę przechowywać dane osobowe tylko przez czas niezbędny do udzielenia odpowiedzi na Twoje zapytanie oraz do spełnienia ewentualnych zobowiązań prawnych lub księgowych. Jeśli chcesz, aby Twoja wiadomość i dane osobowe zostały usunięte wcześniej, zobacz sekcję \"Twoje prawa\" poniżej.",
    "privacyPolicySection5Title": "5. Udostępnianie i ujawnianie",
    "privacyPolicySection5Text": "Nie sprzedaję ani nie wynajmuję danych osobowych. Nie będę udostępniać Twoich danych osobowych stronom trzecim z wyjątkiem następujących ograniczonych okoliczności:",
    "privacyPolicySection5Item1": "Gdy wymaga tego prawo (np. w celu wykonania nakazu sądowego lub procesu prawnego).",
    "privacyPolicySection5Item2": "Dostawcom, którzy przetwarzają dane w moim imieniu na podstawie umowy dotyczącej usług technicznych lub bezpieczeństwa (np. hosting lub usługi bezpieczeństwa). Ci dostawcy są zobowiązani do zapewnienia bezpieczeństwa Twoich danych i przetwarzania ich wyłącznie w celach, które określam.",
    "privacyPolicySection6Title": "6. Pliki cookie i śledzenie",
    "privacyPolicySection6Text": "W momencie tworzenia tej polityki Strona nie wykorzystuje plików cookie do analityki, reklam itp. Jeśli w przyszłości dodam usługi takie jak Google Analytics, zaktualizuję tę politykę i — gdy wymaga tego obowiązujące prawo — uzyskam niezbędną zgodę.",
    "privacyPolicySection7Title": "7. Bezpieczeństwo",
    "privacyPolicySection7Text1": "Podejmuję uzasadnione środki w celu ochrony danych osobowych użytkowników. Stosuję zabezpieczenia techniczne i organizacyjne, aby zapobiegać nieuprawnionemu dostępowi, ujawnieniu lub niewłaściwemu wykorzystaniu informacji użytkowników. Jednak żadna metoda transmisji danych przez Internet ani elektroniczne przechowywanie danych nie jest całkowicie bezpieczna.",
    "privacyPolicySection8Title": "8. Twoje prawa",
    "privacyPolicySection8Text1": "W zależności od miejsca zamieszkania możesz mieć prawo do:",
    "privacyPolicySection8Item1": "Żądania dostępu do posiadanych przeze mnie danych osobowych na Twój temat.",
    "privacyPolicySection8Item2": "Żądania poprawienia nieprawidłowych lub niekompletnych informacji.",
    "privacyPolicySection8Item3": "Żądania usunięcia Twoich danych osobowych.",
    "privacyPolicySection8Item4": "Sprzeciwienia się lub ograniczenia mojego przetwarzania Twoich danych osobowych.",
    "privacyPolicySection8Text2": "Aby skorzystać z któregokolwiek z tych praw, skontaktuj się ze mną pod adresem podanym poniżej. Odpowiem na żądania zgodnie z obowiązującym prawem.",
    "privacyPolicySection9Title": "10. Zmiany w tej polityce",
    "privacyPolicySection9Text": "Mogę od czasu do czasu aktualizować niniejszą Politykę Prywatności. Jeśli wprowadzę istotne zmiany, zaktualizuję Datę obowiązywania u góry tej strony. Dalsze korzystanie ze Strony po takich zmianach oznacza akceptację zaktualizowanej polityki.",
    "privacyPolicySection10Title": "10. Kontakt",
    "privacyPolicySection10Text1": "Jeśli masz pytania dotyczące tej Polityki Prywatności lub chcesz złożyć wniosek dotyczący swoich danych, skontaktuj się:",
    "privacyPolicySection10Text2": "{$START_TAG_STRONG}Mateusz Malich{$CLOSE_TAG_STRONG}{$LINE_BREAK} Email: {$START_LINK}mateuszmalich@gmail.com{$CLOSE_LINK}{$LINE_BREAK} Strona: {$START_LINK_1}malich.dev{$CLOSE_LINK}",
    "privacyPolicyNote": "{$START_EMPHASISED_TEXT}Uwaga: Niniejszy dokument jest szablonem i nie stanowi porady prawnej. Jeśli potrzebujesz polityki dostosowanej do konkretnych zobowiązań prawnych (np. zgodnie z RODO, CCPA lub innymi lokalnymi przepisami), rozważ konsultację z wykwalifikowanym prawnikiem.{$CLOSE_EMPHASISED_TEXT}",
    "screenshotsTitle": "Zrzuty ekranu",
    "technologiesUsed": "Użyte technologie:",
    "links": "Linki:",
    "skills": "Umiejętności:",
    "allProjectsButton": "Sprawdź wszystkie projekty",
    "certLinkButton": "Link do certyfikatu"
  }
}
